{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "80"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "80"}, {"size": "20000"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/ones_like/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/Reshape_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "1"}, {"size": "80"}, {"size": "80"}]}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_3/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Cast_3/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20000"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_1_1/GatherV2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_5/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_6/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "20000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "80"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/Less", "op": "Less", "input": ["inputs", "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/add", "op": "AddV2", "input": ["inputs", "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/Less", "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/add", "inputs"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/SelectV2", "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/GatherV2", "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_1_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/add", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/MatMul_1", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/add", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_2"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/MatMul_2", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/add", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_4"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/Shape", "StatefulPartitionedCall/functional_1_1/transformer_block_1/strided_slice/stack", "StatefulPartitionedCall/functional_1_1/transformer_block_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_1_1/transformer_block_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/MatMul", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_3", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/MatMul_1", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_3/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_5", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/MatMul_2", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_5/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/strided_slice", "StatefulPartitionedCall/functional_1_1/transformer_block_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_1", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_3", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_5", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_2/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/ExpandDims", "StatefulPartitionedCall/functional_1_1/transformer_block_1/Const", "StatefulPartitionedCall/functional_1_1/transformer_block_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_1"], "attr": {"N": {"i": "2"}, "equation": {"s": "QlROSCxCU05ILT5CTlRT"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/Tile", "op": "Tile", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/Reshape_2", "StatefulPartitionedCall/functional_1_1/transformer_block_1/concat"], "attr": {"T": {"type": "DT_BOOL"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/einsum/Einsum", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Cast_3/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/Tile", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/ones_like/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/ones_like", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/ones_like/Shape", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/ones_like/Const"], "attr": {"T": {"type": "DT_BOOL"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/ones_like", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/ExpandDims"]}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/LogicalAnd", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Mul", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Softmax", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_2"], "attr": {"N": {"i": "2"}, "equation": {"s": "Qk5UUyxCU05ILT5CVE5I"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_6", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/einsum_1/Einsum", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_6/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/MatMul_3", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_6", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_7"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/MatMul_3", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_3/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/add", "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/add_1", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/add_1", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/moments/SquaredDifference", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/moments/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/moments/variance", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/Rsqrt", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/Neg", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/add_1", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/mul_1", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/mul_2", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/add_2", "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1/Cast/ReadVariableOp"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1/MatMul", "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1_2/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1/Relu", "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1_2/Cast/ReadVariableOp"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1_2/MatMul", "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1_2/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/add_2", "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/add_2", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/add_2", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/moments/SquaredDifference", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/moments/variance", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/Rsqrt", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/Neg", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/add_2", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/mul_1", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/mul_2", "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_2_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/add_2", "StatefulPartitionedCall/functional_1_1/dense_2_1/Cast/ReadVariableOp"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_2_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1_1/dense_2_1/MatMul", "StatefulPartitionedCall/functional_1_1/dense_2_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1_1/dense_2_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/ones_like/Const", "shape": [], "dtype": "bool"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/Reshape_2", "shape": [1, 80, 80], "dtype": "bool"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape", "shape": [512, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_1/shape", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add/ReadVariableOp", "shape": [2, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_2", "shape": [512, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_3/shape", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_1/ReadVariableOp", "shape": [2, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Cast_3/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/GatherV2/ReadVariableOp", "shape": [20000, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_2/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/token_and_position_embedding_1/embedding_1_1/GatherV2", "shape": [80, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_4", "shape": [512, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_5/shape", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_2/ReadVariableOp", "shape": [2, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_6/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/Reshape_7", "shape": [1024, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/multi_head_attention_1/add_3/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/moments/variance/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/Reshape", "shape": [1, 1, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1/Reshape_1", "shape": [1, 1, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1/Cast/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1_2/Cast/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/sequential_1/dense_1_2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/moments/variance/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/Reshape", "shape": [1, 1, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/transformer_block_1/layer_normalization_1_2/Reshape_1", "shape": [1, 1, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/dense_2_1/Cast/ReadVariableOp", "shape": [512, 20000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/dense_2_1/BiasAdd/ReadVariableOp", "shape": [20000], "dtype": "float32"}]}]}