{"0": "", "1": "[UNK]", "2": "the", "3": ".", "4": ",", "5": "a", "6": "and", "7": "of", "8": "to", "9": "is", "10": "it", "11": "in", "12": "i", "13": "this", "14": "that", "15": "'s", "16": "was", "17": "as", "18": "movie", "19": "with", "20": "for", "21": "but", "22": "film", "23": ")", "24": "you", "25": "on", "26": "'t", "27": "\"", "28": "not", "29": "are", "30": "he", "31": "his", "32": "have", "33": "be", "34": "one", "35": "!", "36": "all", "37": "at", "38": "they", "39": "by", "40": "an", "41": "who", "42": "from", "43": "so", "44": "like", "45": "-", "46": "there", "47": "just", "48": "her", "49": "about", "50": "or", "51": "out", "52": "has", "53": "if", "54": "?", "55": "what", "56": "some", "57": "good", "58": "can", "59": "more", "60": "when", "61": "very", "62": "she", "63": "up", "64": "would", "65": "no", "66": "my", "67": "time", "68": "even", "69": "only", "70": "really", "71": "story", "72": "their", "73": "see", "74": "had", "75": "which", "76": "me", "77": "were", "78": "we", "79": "well", "80": "'", "81": "much", "82": "than", "83": ":", "84": "been", "85": "get", "86": "other", "87": "people", "88": "will", "89": "bad", "90": "great", "91": "do", "92": "into", "93": "also", "94": "him", "95": "because", "96": "first", "97": "most", "98": "how", "99": "don", "100": "them", "101": "its", "102": "then", "103": "made", "104": "make", "105": "could", "106": "way", "107": "too", "108": "movies", "109": "any", "110": "after", "111": "characters", "112": "think", "113": "character", "114": "watch", "115": "films", "116": "many", "117": "two", "118": "seen", "119": ";", "120": "being", "121": "never", "122": "plot", "123": "love", "124": "acting", "125": "show", "126": "did", "127": "know", "128": "best", "129": "where", "130": "life", "131": "little", "132": "ever", "133": "over", "134": "does", "135": "off", "136": "your", "137": "better", "138": "*", "139": "man", "140": "end", "141": "here", "142": "scene", "143": "still", "144": "say", "145": "these", "146": "scenes", "147": "while", "148": "'ve", "149": "why", "150": "something", "151": "such", "152": "should", "153": "go", "154": "through", "155": "back", "156": "'m", "157": "those", "158": "thing", "159": "real", "160": "watching", "161": "now", "162": "doesn", "163": "actors", "164": "didn", "165": "years", "166": "funny", "167": "another", "168": "before", "169": "actually", "170": "makes", "171": "work", "172": "director", "173": "though", "174": "nothing", "175": "find", "176": "look", "177": "lot", "178": "same", "179": "going", "180": "old", "181": "few", "182": "every", "183": "new", "184": "part", "185": "again", "186": "'re", "187": "world", "188": "cast", "189": "us", "190": "things", "191": "want", "192": "quite", "193": "pretty", "194": "&", "195": "down", "196": "around", "197": "seems", "198": "young", "199": "got", "200": "take", "201": "thought", "202": "horror", "203": "fact", "204": "enough", "205": "however", "206": "long", "207": "big", "208": "give", "209": "both", "210": "own", "211": "may", "212": "between", "213": "must", "214": "right", "215": "music", "216": "times", "217": "without", "218": "saw", "219": "series", "220": "always", "221": "comedy", "222": "isn", "223": "role", "224": "original", "225": "guy", "226": "gets", "227": "action", "228": "come", "229": "almost", "230": "interesting", "231": "whole", "232": "least", "233": "point", "234": "done", "235": "\"the", "236": "far", "237": "bit", "238": "script", "239": "minutes", "240": "might", "241": "feel", "242": "family", "243": "'ll", "244": "anything", "245": "am", "246": "since", "247": "last", "248": "performance", "249": "kind", "250": "probably", "251": "away", "252": "tv", "253": "anyone", "254": "yet", "255": "girl", "256": "fun", "257": "worst", "258": "woman", "259": "sure", "260": "rather", "261": "each", "262": "found", "263": "hard", "264": "day", "265": "making", "266": "believe", "267": "our", "268": "10", "269": "course", "270": "2", "271": "trying", "272": "having", "273": "dvd", "274": "goes", "275": "comes", "276": "put", "277": "everything", "278": "set", "279": "shows", "280": "ending", "281": "screen", "282": "place", "283": "book", "284": "played", "285": "worth", "286": "different", "287": "three", "288": "main", "289": "looking", "290": "actor", "291": "someone", "292": "sense", "293": "reason", "294": "'d", "295": "once", "296": "watched", "297": "looks", "298": "money", "299": "effects", "300": "wasn", "301": "maybe", "302": "although", "303": "let", "304": "play", "305": "job", "306": "especially", "307": "everyone", "308": "true", "309": "together", "310": "plays", "311": "said", "312": "audience", "313": "during", "314": "instead", "315": "seem", "316": "later", "317": "takes", "318": "high", "319": "half", "320": "himself", "321": "war", "322": "left", "323": "beautiful", "324": "seeing", "325": "version", "326": "special", "327": "idea", "328": "excellent", "329": "american", "330": "shot", "331": "else", "332": "night", "333": "wife", "334": "mind", "335": "black", "336": "fan", "337": "john", "338": "year", "339": "simply", "340": "completely", "341": "father", "342": "short", "343": "used", "344": "nice", "345": "poor", "346": "death", "347": "second", "348": "house", "349": "read", "350": "help", "351": "along", "352": "men", "353": "either", "354": "less", "355": "kids", "356": "home", "357": "boring", "358": "try", "359": "enjoy", "360": "hollywood", "361": "friends", "362": "use", "363": "given", "364": "need", "365": "wrong", "366": "camera", "367": "classic", "368": "women", "369": "low", "370": "performances", "371": "star", "372": "line", "373": "dead", "374": "production", "375": "stupid", "376": "rest", "377": "next", "378": "couple", "379": "truly", "380": "full", "381": "until", "382": "recommend", "383": "start", "384": "3", "385": "/10", "386": "tell", "387": "school", "388": "mean", "389": "came", "390": "understand", "391": "top", "392": "terrible", "393": "awful", "394": "sex", "395": "won", "396": "getting", "397": "moments", "398": "1", "399": "remember", "400": "itself", "401": "video", "402": "keep", "403": "wonderful", "404": "(and", "405": "person", "406": "name", "407": "others", "408": "(", "409": "episode", "410": "perhaps", "411": "mother", "412": "budget", "413": "small", "414": "face", "415": "playing", "416": "human", "417": "definitely", "418": "doing", "419": "often", "420": "gives", "421": "dialogue", "422": "early", "423": "lines", "424": "children", "425": "perfect", "426": "couldn", "427": "went", "428": "head", "429": "piece", "430": "case", "431": "absolutely", "432": "boy", "433": "title", "434": "finally", "435": "stars", "436": "laugh", "437": "certainly", "438": "become", "439": "liked", "440": "live", "441": "worse", "442": "friend", "443": "entertaining", "444": "picture", "445": "loved", "446": "cinema", "447": "hope", "448": "sort", "449": "style", "450": "felt", "451": "entire", "452": "(the", "453": "supposed", "454": "several", "455": "overall", "456": "guys", "457": "written", "458": "sound", "459": "problem", "460": "lost", "461": "waste", "462": "beginning", "463": "against", "464": "totally", "465": "fans", "466": "care", "467": "wanted", "468": "seemed", "469": "direction", "470": "humor", "471": "lives", "472": "based", "473": "game", "474": "drama", "475": "lead", "476": "throughout", "477": "example", "478": "already", "479": "mr", "480": "guess", "481": "becomes", "482": "under", "483": "turn", "484": "dark", "485": "final", "486": "able", "487": "yes", "488": "called", "489": "despite", "490": "history", "491": "days", "492": "unfortunately", "493": "evil", "494": "white", "495": "killer", "496": "fine", "497": "quality", "498": "wants", "499": "son", "500": "horrible", "501": "amazing", "502": "side", "503": "heart", "504": "writing", "505": "today", "506": "\u0096", "507": "flick", "508": "works", "509": "close", "510": "tries", "511": "viewer", "512": "matter", "513": "4", "514": "past", "515": "oh", "516": "enjoyed", "517": "turns", "518": "act", "519": "gave", "520": "town", "521": "run", "522": "kill", "523": "parts", "524": "stuff", "525": "child", "526": "favorite", "527": "car", "528": "brilliant", "529": "eyes", "530": "behind", "531": "expect", "532": "kid", "533": "girls", "534": "etc", "535": "late", "536": "genre", "537": "themselves", "538": "soon", "539": "art", "540": "god", "541": "michael", "542": "city", "543": "starts", "544": "myself", "545": "killed", "546": "hand", "547": "thinking", "548": "obviously", "549": "actress", "550": "directed", "551": "group", "552": "says", "553": "sometimes", "554": "highly", "555": "decent", "556": "self", "557": "took", "558": "happens", "559": "daughter", "560": "voice", "561": "heard", "562": "anyway", "563": "b", "564": "feeling", "565": "experience", "566": "blood", "567": "moment", "568": "slow", "569": "hour", "570": "fight", "571": "score", "572": "stories", "573": "leave", "574": "told", "575": "extremely", "576": "coming", "577": "chance", "578": "strong", "579": "involved", "580": "cannot", "581": "lack", "582": "roles", "583": "violence", "584": "happen", "585": "wouldn", "586": "(i", "587": "type", "588": "stop", "589": "wonder", "590": "police", "591": "looked", "592": "5", "593": "hilarious", "594": "hit", "595": "happened", "596": "simple", "597": "living", "598": "crap", "599": "attempt", "600": "ago", "601": "obvious", "602": "save", "603": "song", "604": "taken", "605": "shown", "606": "brother", "607": "hell", "608": "writer", "609": "complete", "610": "murder", "611": "across", "612": "gore", "613": "serious", "614": "husband", "615": "english", "616": "interest", "617": "please", "618": "exactly", "619": "ok", "620": "known", "621": "cool", "622": "opening", "623": "seriously", "624": "released", "625": "career", "626": "particularly", "627": "number", "628": "saying", "629": "alone", "630": "age", "631": "sad", "632": "hours", "633": "cinematography", "634": "none", "635": "yourself", "636": "cut", "637": "reality", "638": "david", "639": "annoying", "640": "wish", "641": "order", "642": "except", "643": "relationship", "644": "jokes", "645": "huge", "646": "possible", "647": "talent", "648": "james", "649": "shots", "650": "usually", "651": "hero", "652": "ridiculous", "653": "running", "654": "ends", "655": "view", "656": "started", "657": "opinion", "658": "middle", "659": "documentary", "660": "body", "661": "call", "662": "light", "663": "power", "664": "country", "665": "usual", "666": "ones", "667": "change", "668": "important", "669": "female", "670": "robert", "671": "major", "672": "novel", "673": "knew", "674": "taking", "675": "whose", "676": "disappointed", "677": "rating", "678": "knows", "679": "word", "680": "silly", "681": "words", "682": "somewhat", "683": "beyond", "684": "level", "685": "four", "686": "turned", "687": "attention", "688": "finds", "689": "room", "690": "single", "691": "basically", "692": "cheap", "693": "television", "694": "problems", "695": "upon", "696": "strange", "697": "talking", "698": "non", "699": "musical", "700": "due", "701": "scary", "702": "episodes", "703": "local", "704": "clearly", "705": "apparently", "706": "mostly", "707": "-up", "708": "sequence", "709": "events", "710": "jack", "711": "happy", "712": "including", "713": "british", "714": "aren", "715": ".i", "716": ".the", "717": "modern", "718": "miss", "719": "tells", "720": "review", "721": "earth", "722": "talk", "723": "predictable", "724": "ten", "725": "songs", "726": "add", "727": "dialog", "728": "french", "729": "team", "730": "entertainment", "731": "future", "732": "enjoyable", "733": "easily", "734": "fast", "735": "appears", "736": "above", "737": "sets", "738": "soundtrack", "739": "-the", "740": "whether", "741": "comic", "742": "straight", "743": "haven", "744": "near", "745": "die", "746": "bring", "747": "mention", "748": "giving", "749": "supporting", "750": "king", "751": "similar", "752": "falls", "753": "five", "754": "space", "755": "bunch", "756": "clear", "757": "sequel", "758": "needs", "759": "lots", "760": "surprised", "761": "hate", "762": "moving", "763": "dull", "764": "within", "765": "romantic", "766": "tried", "767": "showing", "768": "certain", "769": "ways", "770": "message", "771": "eye", "772": "filmed", "773": "theater", "774": "parents", "775": "storyline", "776": "theme", "777": "sister", "778": "release", "779": "easy", "780": "george", "781": "effort", "782": "suspense", "783": "thriller", "784": "7", "785": "fall", "786": "among", "787": "comments", "788": "feature", "789": "stand", "790": "subject", "791": "stay", "792": "deal", "793": "named", "794": "working", "795": "buy", "796": "viewers", "797": "doubt", "798": "using", "799": "kept", "800": "feels", "801": "monster", "802": "elements", "803": "editing", "804": "rock", "805": "means", "806": "typical", "807": "nearly", "808": "tale", "809": "lady", "810": "avoid", "811": "points", "812": "greatest", "813": "viewing", "814": "fantastic", "815": "oscar", "816": "herself", "817": "gone", "818": "actual", "819": "dog", "820": "material", "821": "imagine", "822": "general", "823": "form", "824": "follow", "825": "(which", "826": "sorry", "827": "famous", "828": "brought", "829": "realistic", "830": "believable", "831": "move", "832": "begins", "833": "8", "834": "reviews", "835": "class", "836": "leads", "837": "animation", "838": "period", "839": "somehow", "840": "forget", "841": "dr", "842": "crime", "843": "rent", "844": "hear", "845": "mystery", "846": "weak", "847": "york", "848": "sit", "849": "okay", "850": "america", "851": "figure", "852": "premise", "853": "sequences", "854": "check", "855": "peter", "856": "learn", "857": "atmosphere", "858": "eventually", "859": "(as", "860": "expected", "861": "particular", "862": "imdb", "863": "richard", "864": "poorly", "865": "situation", "866": "surprise", "867": "lame", "868": "indeed", "869": "open", "870": "killing", "871": "doctor", "872": "decided", "873": "shame", "874": "(or", "875": "wait", "876": "society", "877": "difficult", "878": "truth", "879": "re", "880": "sci", "881": "third", "882": "\"i", "883": "tom", "884": "box", "885": "deep", "886": "leaves", "887": "red", "888": "average", "889": "season", "890": "footage", "891": "crew", "892": "became", "893": "needed", "894": "boys", "895": "20", "896": "paul", "897": "dance", "898": "forced", "899": "emotional", "900": "begin", "901": "memorable", "902": "lee", "903": "9", "904": "credits", "905": "question", "906": "whatever", "907": "minute", "908": "otherwise", "909": "reading", "910": "write", "911": "romance", "912": "hands", "913": "superb", "914": "features", "915": "possibly", "916": "sexual", "917": "nature", "918": "interested", "919": "gay", "920": "meets", "921": "cheesy", "922": "street", "923": "perfectly", "924": "meet", "925": "screenplay", "926": "effect", "927": "comment", "928": "previous", "929": "male", "930": "island", "931": "beauty", "932": "laughs", "933": "western", "934": "quickly", "935": "hot", "936": "-fi", "937": "note", "938": "masterpiece", "939": "badly", "940": "result", "941": "keeps", "942": "towards", "943": "personal", "944": "nor", "945": "free", "946": "stage", "947": "sounds", "948": "earlier", "949": "inside", "950": "total", "951": "o", "952": "incredibly", "953": "air", "954": "mess", "955": "japanese", "956": "weird", "957": "worked", "958": "background", "959": "(a", "960": "de", "961": "copy", "962": "realize", "963": "setting", "964": "plus", "965": "disney", "966": "unique", "967": "whom", "968": "business", "969": "writers", "970": "various", "971": "pay", "972": "battle", "973": "powerful", "974": "following", "975": "cop", "976": "appear", "977": "unless", "978": "older", "979": "brings", "980": "ask", "981": "development", "982": "crazy", "983": "plenty", "984": "directors", "985": "dumb", "986": "baby", "987": "admit", "988": "creepy", "989": "acted", "990": "directing", "991": "reasons", "992": "fairly", "993": "front", "994": "forward", "995": "mark", "996": "joke", "997": "spent", "998": "dream", "999": "water", "1000": "girlfriend", "1001": "'the", "1002": "leading", "1003": "deserves", "1004": "portrayed", "1005": "fails", "1006": "dramatic", "1007": "wasted", "1008": "(who", "1009": "success", "1010": "rich", "1011": "fire", "1012": "outside", "1013": "bill", "1014": "meant", "1015": "-and", "1016": "cover", "1017": "joe", "1018": "attempts", "1019": "break", "1020": "expecting", "1021": "ideas", "1022": "agree", "1023": "manages", "1024": "80", "1025": "recently", "1026": "political", "1027": "apart", "1028": "present", "1029": "create", "1030": "party", "1031": "caught", "1032": "missing", "1033": "fighting", "1034": "gun", "1035": "large", "1036": "match", "1037": "hardly", "1038": "ended", "1039": ".and", "1040": "villain", "1041": "laughing", "1042": "plain", "1043": "members", "1044": "era", "1045": "filmmakers", "1046": "telling", "1047": "talented", "1048": "remake", "1049": "public", "1050": "german", "1051": "nudity", "1052": "clever", "1053": "potential", "1054": "zombie", "1055": "odd", "1056": "pace", "1057": "cute", "1058": "missed", "1059": "fantasy", "1060": "state", "1061": "secret", "1062": "flat", "1063": "casting", "1064": "escape", "1065": "created", "1066": "company", "1067": "cartoon", "1068": "pure", "1069": "further", "1070": "twist", "1071": "italian", "1072": "list", "1073": "unlike", "1074": "return", "1075": "hold", "1076": "waiting", "1077": "incredible", "1078": "william", "1079": "train", "1080": "married", "1081": "visual", "1082": "died", "1083": "co", "1084": "slightly", "1085": "familiar", "1086": "van", "1087": "considering", "1088": "mentioned", "1089": "store", "1090": "30", "1091": "uses", "1092": "speak", "1093": "decides", "1094": "credit", "1095": "sadly", "1096": "convincing", "1097": "tension", "1098": "scott", "1099": "entirely", "1100": "science", "1101": "bored", "1102": "century", "1103": "sees", "1104": "wrote", "1105": "produced", "1106": "popular", "1107": "follows", "1108": "value", "1109": "portrayal", "1110": "appreciate", "1111": "/", "1112": "language", "1113": "cold", "1114": "band", "1115": "rate", "1116": "trouble", "1117": "office", "1118": "neither", "1119": "choice", "1120": "amount", "1121": "compared", "1122": "former", "1123": "moves", "1124": "younger", "1125": "suddenly", "1126": "fit", "1127": "biggest", "1128": "common", "1129": "college", "1130": "hair", "1131": "brothers", "1132": "images", "1133": "force", "1134": "project", "1135": "anti", "1136": "intelligent", "1137": "situations", "1138": "dancing", "1139": "recommended", "1140": "concept", "1141": "brain", "1142": "social", "1143": "-in", "1144": ".it", "1145": "successful", "1146": "sweet", "1147": "longer", "1148": "amusing", "1149": "alive", "1150": "producers", "1151": "pointless", "1152": "exciting", "1153": "violent", "1154": "fear", "1155": "pathetic", "1156": "filled", "1157": "spend", "1158": "ultimately", "1159": "studio", "1160": "decide", "1161": "bizarre", "1162": "d", "1163": "recent", "1164": "effective", "1165": "6", "1166": "positive", "1167": "kills", "1168": "post", "1169": "honest", "1170": "cause", "1171": "questions", "1172": "focus", "1173": "control", "1174": "90", "1175": "drug", "1176": "depth", "1177": "(in", "1178": "likes", "1179": "consider", "1180": "sick", "1181": "awesome", "1182": "weren", "1183": "spirit", "1184": "master", "1185": "fake", "1186": "christmas", "1187": "impressive", "1188": "garbage", "1189": "cat", "1190": "channel", "1191": "jane", "1192": "changed", "1193": "values", "1194": "gang", "1195": "humour", "1196": "respect", "1197": "impossible", "1198": "showed", "1199": "barely", "1200": "accent", "1201": "solid", "1202": "pick", "1203": "15", "1204": "u", "1205": "involving", "1206": "basic", "1207": "mad", "1208": "trash", "1209": "singing", "1210": "revenge", "1211": "culture", "1212": "walk", "1213": "-to", "1214": "immediately", "1215": "vampire", "1216": "failed", "1217": "books", "1218": "aside", "1219": "shoot", "1220": "prison", "1221": "-like", "1222": "audiences", "1223": "chemistry", "1224": "park", "1225": "leaving", "1226": "disturbing", "1227": "bought", "1228": "conclusion", "1229": "somewhere", "1230": "shooting", "1231": "considered", "1232": "super", "1233": "genius", "1234": "week", "1235": "ability", "1236": "soldiers", "1237": "touch", "1238": "fair", "1239": "honestly", "1240": "fiction", "1241": "meaning", "1242": "added", "1243": "ben", "1244": "trip", "1245": "sitting", "1246": "mood", "1247": "explain", "1248": "thinks", "1249": "army", "1250": "glad", "1251": "win", "1252": "road", "1253": "bother", "1254": "adventure", "1255": "runs", "1256": "bed", "1257": "camp", "1258": "adult", "1259": "tone", "1260": ".s", "1261": "south", "1262": "issues", "1263": "tough", "1264": "journey", "1265": "ex", "1266": "west", "1267": "surprisingly", "1268": "starring", "1269": "nobody", "1270": "stick", "1271": "personally", "1272": "chase", "1273": "purpose", "1274": "yeah", "1275": "likely", "1276": "twists", "1277": "nowhere", "1278": "taste", "1279": "alien", "1280": "beautifully", "1281": "slasher", "1282": "remains", "1283": "jim", "1284": "thanks", "1285": "blue", "1286": "cult", "1287": "spoilers", "1288": "appearance", "1289": "charles", "1290": "aspect", "1291": "sexy", "1292": "literally", "1293": "available", "1294": "sam", "1295": "london", "1296": "government", "1297": "dad", "1298": "t", "1299": "complex", "1300": "terms", "1301": "generally", "1302": "computer", "1303": "animated", "1304": "%", "1305": "scenery", "1306": "edge", "1307": "utterly", "1308": "presence", "1309": "pictures", "1310": "cinematic", "1311": "subtle", "1312": "photography", "1313": "standard", "1314": "silent", "1315": "mary", "1316": "door", "1317": "catch", "1318": ".but", "1319": "managed", "1320": "terrific", "1321": "heavy", "1322": "charming", "1323": "ride", "1324": "jones", "1325": "soul", "1326": "disappointing", "1327": "constantly", "1328": "adaptation", "1329": "military", "1330": "thrown", "1331": "laughable", "1332": "changes", "1333": "suppose", "1334": "lovely", "1335": "everybody", "1336": "emotions", "1337": "appeal", "1338": "100", "1339": "historical", "1340": "bond", "1341": "smart", "1342": "la", "1343": "drive", "1344": "details", "1345": "planet", "1346": "normal", "1347": "frank", "1348": "victim", "1349": "bottom", "1350": "narrative", "1351": "comedies", "1352": "rare", "1353": "places", "1354": "knowing", "1355": "magic", "1356": "innocent", "1357": "pieces", "1358": "law", "1359": "unbelievable", "1360": "pass", "1361": "award", "1362": "natural", "1363": "costumes", "1364": "touching", "1365": "giant", "1366": "slowly", "1367": "painful", "1368": "loves", "1369": "indian", "1370": "impression", "1371": "date", "1372": "producer", "1373": "intended", "1374": "names", "1375": "ship", "1376": "charlie", "1377": "walking", "1378": "stands", "1379": "naked", "1380": "filming", "1381": "building", "1382": "presented", "1383": "detective", "1384": "festival", "1385": "feelings", "1386": "smith", "1387": "track", "1388": "throw", "1389": "finish", "1390": "puts", "1391": "themes", "1392": "outstanding", "1393": "equally", "1394": "zombies", "1395": "-of", "1396": "student", "1397": "club", "1398": "boyfriend", "1399": "brief", "1400": "thus", "1401": "steve", "1402": "hurt", "1403": "fully", "1404": "f", "1405": "minor", "1406": "mistake", "1407": "hoping", "1408": "excuse", "1409": "central", "1410": "opera", "1411": "contains", "1412": "manner", "1413": "wild", "1414": "race", "1415": "expectations", "1416": "disappointment", "1417": "aspects", "1418": "acts", "1419": "makers", "1420": "ray", "1421": "land", "1422": "tony", "1423": "forever", "1424": "critics", "1425": "sub", "1426": "sent", "1427": "loud", "1428": "emotion", "1429": "climax", "1430": "tired", "1431": "harry", "1432": "attack", "1433": "stunning", "1434": "plan", "1435": "hospital", "1436": "mysterious", "1437": "\"a", "1438": "surely", "1439": "ghost", "1440": "opportunity", "1441": "fascinating", "1442": "notice", "1443": "green", "1444": "chris", "1445": "boss", "1446": "50", "1447": "image", "1448": "70", "1449": "pain", "1450": "justice", "1451": "support", "1452": "offer", "1453": "charm", "1454": "-out", "1455": "ahead", "1456": "paris", "1457": "laughed", "1458": "teen", "1459": "bruce", "1460": "besides", "1461": ".a", "1462": "faces", "1463": "students", "1464": "hitchcock", "1465": "happening", "1466": "cry", "1467": "grade", "1468": "confusing", "1469": "-making", "1470": "suggest", "1471": "include", "1472": "dreams", "1473": "_", "1474": "content", "1475": "folks", "1476": "stewart", "1477": "exception", "1478": "clich\u00e9", "1479": "thank", "1480": "news", "1481": "fresh", "1482": "color", "1483": "double", "1484": "confused", "1485": "ed", "1486": "lived", "1487": "flicks", "1488": "six", "1489": "random", "1490": "answer", "1491": "direct", "1492": "c", "1493": "agent", "1494": "speaking", "1495": "motion", "1496": "fell", "1497": "mainly", "1498": "dies", "1499": "compelling", "1500": "relationships", "1501": "location", "1502": "difference", "1503": "martin", "1504": "marriage", "1505": "drugs", "1506": "million", "1507": "lacks", "1508": "affair", "1509": "-movie", "1510": "likable", "1511": "impressed", "1512": "-budget", "1513": "summer", "1514": "rated", "1515": "ii", "1516": "finding", "1517": "drawn", "1518": "kelly", "1519": "twice", "1520": "pull", "1521": "holes", "1522": "gem", "1523": "collection", "1524": "mom", "1525": "ground", "1526": "trailer", "1527": "approach", "1528": "information", "1529": "helps", "1530": "cops", "1531": "bar", "1532": "spot", "1533": "lighting", "1534": "developed", "1535": "adds", "1536": "wow", "1537": "seemingly", "1538": "appeared", "1539": "share", "1540": "lover", "1541": "shock", "1542": "industry", "1543": "church", "1544": "delivers", "1545": "paid", "1546": "funniest", "1547": "anymore", "1548": "victims", "1549": "mix", "1550": "wondering", "1551": "flaws", "1552": "moral", "1553": "element", "1554": "(not", "1555": "gorgeous", "1556": "detail", "1557": "adults", "1558": "plane", "1559": "falling", "1560": "radio", "1561": "porn", "1562": "hotel", "1563": "born", "1564": "hasn", "1565": "system", "1566": "creative", "1567": ",and", "1568": "therefore", "1569": "machine", "1570": "offers", "1571": "intense", "1572": "-time", "1573": "rented", "1574": "extreme", "1575": "billy", "1576": "supposedly", "1577": "allowed", "1578": "putting", "1579": "followed", "1580": "soldier", "1581": "quick", "1582": "christopher", "1583": "ugly", "1584": "russian", "1585": "reminded", "1586": "merely", "1587": "latter", "1588": "forgotten", "1589": "stuck", "1590": "mediocre", "1591": "provides", "1592": "count", "1593": "impact", "1594": "grace", "1595": "ms", "1596": "suicide", "1597": "event", "1598": "animals", "1599": "wood", "1600": "serial", "1601": "key", "1602": "vs", "1603": "station", "1604": "imagination", "1605": "attractive", "1606": "shouldn", "1607": "becoming", "1608": "beat", "1609": "area", "1610": "onto", "1611": "ready", "1612": "negative", "1613": "led", "1614": "fellow", "1615": "cgi", "1616": "standards", "1617": "disaster", "1618": "pop", "1619": "murders", "1620": "extra", "1621": "absolute", "1622": "woods", "1623": "scientist", "1624": "jackson", "1625": "fashion", "1626": "phone", "1627": "americans", "1628": "seconds", "1629": "personality", "1630": "games", "1631": "whatsoever", "1632": "step", "1633": "rip", "1634": "jean", "1635": "picked", "1636": "angry", "1637": "returns", "1638": "batman", "1639": "tragedy", "1640": "states", "1641": "lies", "1642": "lets", "1643": "compare", "1644": "captain", "1645": "worthy", "1646": "turning", "1647": "helped", "1648": "ford", "1649": "actions", "1650": "thoroughly", "1651": "-a", "1652": "tragic", "1653": "torture", "1654": "commentary", "1655": "teacher", "1656": "deliver", "1657": "member", "1658": "damn", "1659": "process", "1660": "nasty", "1661": "christian", "1662": "proves", "1663": "moved", "1664": "lose", "1665": "creature", "1666": "childhood", "1667": "accident", "1668": "theatre", "1669": "addition", "1670": "actresses", "1671": "wall", "1672": "afraid", "1673": "wooden", "1674": "thats", "1675": "sea", "1676": "passion", "1677": "search", "1678": "shocking", "1679": "epic", "1680": "seven", "1681": "fox", "1682": "cross", "1683": "continue", "1684": "sleep", "1685": "asked", "1686": "wearing", "1687": "carry", "1688": "began", "1689": "apartment", "1690": "teenage", "1691": "provide", "1692": "willing", "1693": "memory", "1694": "listen", "1695": "favourite", "1696": "describe", "1697": "clothes", "1698": "artistic", "1699": "40", "1700": "sucks", "1701": "horse", "1702": "flying", "1703": "sight", "1704": "bits", "1705": "(with", "1706": "wars", "1707": "wanting", "1708": "held", "1709": "dying", "1710": "judge", "1711": "anybody", "1712": "realized", "1713": "pleasure", "1714": "noir", "1715": "mouth", "1716": "inspired", "1717": "rarely", "1718": "ryan", "1719": "build", "1720": "gold", "1721": "numbers", "1722": "intelligence", "1723": "struggle", "1724": "suspect", "1725": "introduced", "1726": "jr", "1727": "energy", "1728": "intriguing", "1729": "physical", "1730": "redeeming", "1731": "professional", "1732": "design", "1733": "allow", "1734": "twenty", "1735": "accept", "1736": "tears", "1737": "spoiler", "1738": "queen", "1739": "necessary", "1740": "jason", "1741": "zero", "1742": "martial", "1743": "food", "1744": "henry", "1745": "independent", "1746": "clich\u00e9s", "1747": "anywhere", "1748": "watchable", "1749": "mid", "1750": "holds", "1751": "deserve", "1752": "-year", "1753": "surprising", "1754": "brown", "1755": "arts", "1756": "thomas", "1757": "stone", "1758": "calls", "1759": "williams", "1760": "religious", "1761": "superior", "1762": "jerry", "1763": "filmmaker", "1764": "desert", "1765": "deeply", "1766": "chinese", "1767": "asks", "1768": "rape", "1769": "hidden", "1770": "accurate", "1771": ".this", "1772": "dangerous", "1773": "dirty", "1774": "comedic", "1775": "tim", "1776": "artist", "1777": "wonderfully", "1778": "includes", "1779": "bloody", "1780": "(if", "1781": "sat", "1782": "reminds", "1783": "kevin", "1784": "hey", "1785": "l", "1786": ",000", "1787": "blame", "1788": "soft", "1789": "understanding", "1790": "moon", "1791": "mine", "1792": "-off", "1793": "treat", "1794": "shakespeare", "1795": "pacing", "1796": "explanation", "1797": "brutal", "1798": "page", "1799": "limited", "1800": "below", "1801": "apparent", "1802": "criminal", "1803": "unusual", "1804": "friendship", "1805": "trust", "1806": "nicely", "1807": "unknown", "1808": "thin", "1809": "somebody", "1810": "animal", "1811": "al", "1812": "+", "1813": "remarkable", "1814": "officer", "1815": "mike", "1816": "joy", "1817": "danny", "1818": "hated", "1819": "(it", "1820": "ring", "1821": "fat", "1822": "allen", "1823": "moore", "1824": "memories", "1825": "opposite", "1826": "loose", "1827": "boat", "1828": "noticed", "1829": "12", "1830": "-old", "1831": "vhs", "1832": "locations", "1833": "ill", "1834": "howard", "1835": "gags", "1836": "wind", "1837": "unnecessary", "1838": "scared", "1839": "met", "1840": "stock", "1841": "price", "1842": "issue", "1843": "captured", "1844": "whilst", "1845": "months", "1846": "leader", "1847": "heads", "1848": "engaging", "1849": "learned", "1850": "community", "1851": "board", "1852": "knowledge", "1853": "academy", "1854": "references", "1855": "powers", "1856": "anne", "1857": "grand", "1858": "discover", "1859": "uncle", "1860": "soap", "1861": "singer", "1862": "player", "1863": "vision", "1864": "plots", "1865": "monsters", "1866": "lord", "1867": "humanity", "1868": "heroes", "1869": "responsible", "1870": "creating", "1871": "roll", "1872": "lovers", "1873": "johnny", "1874": "absurd", "1875": ".e", "1876": "starting", "1877": "normally", "1878": "mental", "1879": "constant", "1880": "s", "1881": "field", "1882": "desperate", "1883": "floor", "1884": "driving", "1885": "buddy", "1886": "players", "1887": "wide", "1888": "smile", "1889": "record", "1890": "lacking", "1891": "humans", "1892": "manage", "1893": "arthur", "1894": "treated", "1895": "skip", "1896": "generation", "1897": "finished", "1898": "explained", "1899": "conflict", "1900": "-on", "1901": "comparison", "1902": "survive", "1903": "connection", "1904": "warning", "1905": "technical", "1906": "pre", "1907": "exist", "1908": "window", "1909": "keeping", "1910": "ice", "1911": "hits", "1912": "england", "1913": "taylor", "1914": "shop", "1915": "hadn", "1916": "fights", "1917": "efforts", "1918": "cars", "1919": "(like", "1920": "morning", "1921": "current", "1922": "stephen", "1923": "growing", "1924": "length", "1925": "fail", "1926": "behavior", "1927": "rubbish", "1928": "loving", "1929": "alan", "1930": "pilot", "1931": "mixed", "1932": "magnificent", "1933": "j", "1934": "included", "1935": "faith", "1936": "eddie", "1937": "bigger", "1938": "president", "1939": "deserved", "1940": "brian", "1941": "occasionally", "1942": "numerous", "1943": "murdered", "1944": "mission", "1945": "gotten", "1946": "forces", "1947": "prove", "1948": "instance", "1949": "capture", "1950": "crappy", "1951": "witty", "1952": "witch", "1953": "protagonist", "1954": "loss", "1955": "finest", "1956": "davis", "1957": "bland", "1958": "tape", "1959": "genuine", "1960": "priest", "1961": "originally", "1962": "bob", "1963": "partner", "1964": "media", "1965": "advice", "1966": "devil", "1967": "desire", "1968": "according", "1969": "villains", "1970": "legend", "1971": "whenever", "1972": "r", "1973": "empty", "1974": "realism", "1975": "hopes", "1976": "deals", "1977": "river", "1978": "jump", "1979": "humorous", "1980": "cable", "1981": "bright", "1982": "revealed", "1983": "pair", "1984": "ordinary", "1985": "kick", "1986": "heroine", "1987": "terribly", "1988": "nonsense", "1989": "dealing", "1990": "toward", "1991": "eat", "1992": "cuts", "1993": "\"you", "1994": "naturally", "1995": "essentially", "1996": "\"what", "1997": "stereotypes", "1998": "spanish", "1999": "relate", "2000": "finale", "2001": "crowd", "2002": "aware", "2003": "60", "2004": "youth", "2005": "x", "2006": "golden", "2007": "frankly", "2008": "sing", "2009": "results", "2010": "lynch", "2011": "guns", "2012": "favor", "2013": "concerned", "2014": "broken", "2015": "wayne", "2016": "suit", "2017": "pulled", "2018": "=", "2019": "kinda", "2020": "heaven", "2021": "sean", "2022": "quiet", "2023": "owner", "2024": "fate", "2025": "teenagers", "2026": "village", "2027": "sign", "2028": "program", "2029": "drunk", "2030": "dressed", "2031": "talents", "2032": "streets", "2033": "skills", "2034": "sheer", "2035": "feet", "2036": "ball", "2037": "hunter", "2038": "european", "2039": "national", "2040": "meanwhile", "2041": "foreign", "2042": "/2", "2043": "sucked", "2044": "mrs", "2045": "context", "2046": "castle", "2047": "unfunny", "2048": "received", "2049": "higher", "2050": "genuinely", "2051": "discovered", "2052": ",but", "2053": "saved", "2054": "psychological", "2055": "international", "2056": "insane", "2057": "gary", "2058": "france", "2059": "utter", "2060": "study", "2061": "private", "2062": "visit", "2063": "regular", "2064": "levels", "2065": "attitude", "2066": "winning", "2067": "robin", "2068": "remembered", "2069": "portray", "2070": "miles", "2071": "max", "2072": "lesson", "2073": "frame", "2074": "author", "2075": "african", "2076": "(played", "2077": "vote", "2078": "unable", "2079": "irritating", "2080": "continues", "2081": "wise", "2082": "visuals", "2083": "texas", "2084": "reach", "2085": "range", "2086": "dreadful", "2087": "adam", "2088": "spectacular", "2089": "fly", "2090": "failure", "2091": "debut", "2092": "breaks", "2093": "awkward", "2094": "screaming", "2095": "reviewers", "2096": "reaction", "2097": "featuring", "2098": "edited", "2099": "decision", "2100": "decade", "2101": "fault", "2102": "-life", "2103": "individual", "2104": "blind", "2105": "steal", "2106": "opens", "2107": "site", "2108": "sheriff", "2109": "satire", "2110": "evidence", "2111": "dated", "2112": "cameo", "2113": ",the", "2114": "strength", "2115": "saving", "2116": "p", "2117": "overly", "2118": "bomb", "2119": "andy", "2120": "existence", "2121": "unrealistic", "2122": "ultimate", "2123": "joan", "2124": "jeff", "2125": "grow", "2126": "cash", "2127": "unexpected", "2128": "logic", "2129": "flashbacks", "2130": "described", "2131": "perspective", "2132": "lewis", "2133": "gangster", "2134": "football", "2135": "wedding", "2136": "trek", "2137": "contrived", "2138": "anthony", "2139": "(although", "2140": "travel", "2141": "sell", "2142": "ran", "2143": "identity", "2144": "gory", "2145": "corny", "2146": "shallow", "2147": "fame", "2148": "curious", "2149": "commercial", "2150": "80s", "2151": "parody", "2152": "nick", "2153": "native", "2154": "e", "2155": "douglas", "2156": "seat", "2157": "relief", "2158": "ladies", "2159": "discovers", "2160": "creatures", "2161": "cost", "2162": "lucky", "2163": "australian", "2164": "sake", "2165": "grown", "2166": "europe", "2167": "beach", "2168": "asian", "2169": "visually", "2170": "teenager", "2171": "pretentious", "2172": "nightmare", "2173": "jimmy", "2174": "gonna", "2175": "classics", "2176": "keaton", "2177": "involves", "2178": "flesh", "2179": "choose", "2180": "cares", "2181": "bank", "2182": "grew", "2183": "delightful", "2184": "combination", "2185": "luck", "2186": "julie", "2187": "japan", "2188": "freedom", "2189": "drag", "2190": "laughter", "2191": "graphic", "2192": "delivered", "2193": "-man", "2194": "underrated", "2195": "theaters", "2196": "provided", "2197": "endless", "2198": "bodies", "2199": "jennifer", "2200": "sisters", "2201": "rescue", "2202": "paper", "2203": "meeting", "2204": "creates", "2205": "ann", "2206": "reviewer", "2207": "fill", "2208": "(he", "2209": "types", "2210": "heck", "2211": "emotionally", "2212": "disgusting", "2213": "candy", "2214": "(for", "2215": "talks", "2216": "steven", "2217": "remain", "2218": "recall", "2219": "product", "2220": "families", "2221": "eric", "2222": "chaplin", "2223": "center", "2224": "capable", "2225": "built", "2226": "asking", "2227": "aliens", "2228": "alex", "2229": "ages", "2230": "vampires", "2231": "standing", "2232": "speech", "2233": "proved", "2234": "allows", "2235": "loses", "2236": "cant", "2237": "brilliantly", "2238": "tiny", "2239": "formula", "2240": "driver", "2241": "clean", "2242": "assume", "2243": "sympathetic", "2244": "eating", "2245": "destroy", "2246": "believes", "2247": "(even", "2248": "(but", "2249": "hitler", "2250": "costs", "2251": "contrast", "2252": "promise", "2253": "hall", "2254": "develop", "2255": "send", "2256": "kong", "2257": "\"it", "2258": "treatment", "2259": "nevertheless", "2260": "majority", "2261": "test", "2262": "embarrassing", "2263": "dollars", "2264": "rules", "2265": "bringing", "2266": "tedious", "2267": "round", "2268": "executed", "2269": "enemy", "2270": "strongly", "2271": "scream", "2272": "rose", "2273": "fred", "2274": "viewed", "2275": "steals", "2276": "seagal", "2277": "portrays", "2278": "handsome", "2279": "chick", "2280": "ass", "2281": "traditional", "2282": "thoughts", "2283": "horribly", "2284": "evening", "2285": "crash", "2286": "circumstances", "2287": "gordon", "2288": "chief", "2289": "ancient", "2290": "sequels", "2291": "model", "2292": "matters", "2293": "correct", "2294": "walked", "2295": "rise", "2296": "lousy", "2297": "bbc", "2298": "universal", "2299": "rental", "2300": "germany", "2301": "religion", "2302": "mini", "2303": "dogs", "2304": "bear", "2305": "70s", "2306": "surreal", "2307": "jesus", "2308": "caused", "2309": "blonde", "2310": "dan", "2311": "awards", "2312": "-it", "2313": "sky", "2314": "research", "2315": "weeks", "2316": "walks", "2317": "chan", "2318": "cage", "2319": "voices", "2320": "passed", "2321": "larry", "2322": "excited", "2323": "technology", "2324": "facts", "2325": "dubbed", "2326": "suffering", "2327": "subtitles", "2328": "speed", "2329": "sharp", "2330": "harris", "2331": "entertained", "2332": "anderson", "2333": "united", "2334": "source", "2335": "shocked", "2336": "proper", "2337": "pleasant", "2338": "pity", "2339": "north", "2340": "network", "2341": "louis", "2342": "contemporary", "2343": "clue", "2344": "alice", "2345": "terror", "2346": "stopped", "2347": "produce", "2348": "prince", "2349": "hopefully", "2350": "(especially", "2351": "jackie", "2352": "insult", "2353": "depressing", "2354": "core", "2355": "amateurish", "2356": "-looking", "2357": "universe", "2358": "theatrical", "2359": "surface", "2360": "painfully", "2361": "killers", "2362": "wilson", "2363": "vehicle", "2364": "twisted", "2365": "portraying", "2366": "plans", "2367": "mask", "2368": "losing", "2369": "bet", "2370": "hunt", "2371": "gratuitous", "2372": "factor", "2373": "extras", "2374": "dick", "2375": "cartoons", "2376": "wit", "2377": "sudden", "2378": "ruined", "2379": "experienced", "2380": "barbara", "2381": "versions", "2382": "exploitation", "2383": "washington", "2384": "largely", "2385": "service", "2386": "qualities", "2387": "learns", "2388": "hearing", "2389": "propaganda", "2390": "fits", "2391": "morgan", "2392": "gene", "2393": "depicted", "2394": "table", "2395": "matt", "2396": "marry", "2397": "g", "2398": "dry", "2399": "committed", "2400": "angles", "2401": "virtually", "2402": "spoil", "2403": "spends", "2404": "lake", "2405": "chosen", "2406": "influence", "2407": "haunting", "2408": "11", "2409": "segment", "2410": "rob", "2411": "jungle", "2412": "substance", "2413": "sports", "2414": "slapstick", "2415": "skin", "2416": "halloween", "2417": "eight", "2418": "department", "2419": "winner", "2420": "till", "2421": "teens", "2422": "latest", "2423": "asleep", "2424": "-top", "2425": "hill", "2426": "angel", "2427": "(that", "2428": "truck", "2429": "darkness", "2430": "werewolf", "2431": "warm", "2432": "uk", "2433": "tend", "2434": "scare", "2435": "recognize", "2436": "practically", "2437": "lane", "2438": "holmes", "2439": "excitement", "2440": "variety", "2441": "target", "2442": "enter", "2443": "convince", "2444": "albert", "2445": "-for", "2446": "veteran", "2447": "promising", "2448": "kung", "2449": "experiences", "2450": "drop", "2451": "display", "2452": "claim", "2453": "turkey", "2454": "lesbian", "2455": "appropriate", "2456": "satisfying", "2457": "professor", "2458": "makeup", "2459": "fish", "2460": "costume", "2461": "believed", "2462": "patient", "2463": "movement", "2464": "canadian", "2465": "blow", "2466": "(though", "2467": "worthwhile", "2468": "studios", "2469": "speaks", "2470": "patrick", "2471": "nominated", "2472": "captures", "2473": "johnson", "2474": "jewish", "2475": "holding", "2476": "performed", "2477": "appealing", "2478": "-so", "2479": "witness", "2480": "unfortunate", "2481": "sympathy", "2482": "conversation", "2483": ".5", "2484": "suffers", "2485": "murphy", "2486": "mountain", "2487": "cutting", "2488": "semi", "2489": "presents", "2490": "foot", "2491": "featured", "2492": "structure", "2493": "peace", "2494": "lower", "2495": "hide", "2496": "guilty", "2497": "training", "2498": "russell", "2499": "routine", "2500": "prime", "2501": "previously", "2502": "idiot", "2503": "continuity", "2504": "calling", "2505": "accents", "2506": "statement", "2507": "scale", "2508": "irish", "2509": "harsh", "2510": "hanging", "2511": "handled", "2512": "broadway", "2513": "anna", "2514": "amateur", "2515": "vietnam", "2516": "ted", "2517": "suspenseful", "2518": "relatively", "2519": "psycho", "2520": "draw", "2521": "abuse", "2522": "safe", "2523": "degree", "2524": "danger", "2525": "clich\u00e9d", "2526": "sun", "2527": "obsessed", "2528": "market", "2529": "extraordinary", "2530": "chose", "2531": "category", "2532": "simon", "2533": "seasons", "2534": "robot", "2535": "offensive", "2536": "everywhere", "2537": "encounter", "2538": "bothered", "2539": "/or", "2540": "roger", "2541": "grant", "2542": "saturday", "2543": "regret", "2544": "massive", "2545": "favorites", "2546": "(at", "2547": "touches", "2548": "parker", "2549": "granted", "2550": "edward", "2551": "crying", "2552": "-be", "2553": "westerns", "2554": "refreshing", "2555": "joseph", "2556": "forgettable", "2557": "claims", "2558": "reveal", "2559": "praise", "2560": "kate", "2561": "figured", "2562": "directly", "2563": "anime", "2564": "surprises", "2565": "h", "2566": "grave", "2567": "dean", "2568": "accidentally", "2569": "supernatural", "2570": "rule", "2571": "prior", "2572": "inner", "2573": "destroyed", "2574": "africa", "2575": "unlikely", "2576": "serves", "2577": "politics", "2578": "exact", "2579": "belief", "2580": "reporter", "2581": "realizes", "2582": "naive", "2583": "minds", "2584": "melodrama", "2585": "forth", "2586": "cell", "2587": "sorts", "2588": "section", "2589": "junk", "2590": "initial", "2591": "dennis", "2592": "cruel", "2593": "china", "2594": "trapped", "2595": "security", "2596": "fool", "2597": "demon", "2598": "trilogy", "2599": "roberts", "2600": "required", "2601": "amazingly", "2602": "roy", "2603": "pulls", "2604": "hat", "2605": "forgot", "2606": "deaths", "2607": "covered", "2608": "california", "2609": "adventures", "2610": ".g", "2611": "rough", "2612": "proud", "2613": "prepared", "2614": "drew", "2615": "deadly", "2616": "abandoned", "2617": "tight", "2618": "haunted", "2619": "express", "2620": "eastwood", "2621": "closer", "2622": "tarzan", "2623": "summary", "2624": "stereotypical", "2625": "effectively", "2626": "renting", "2627": "sides", "2628": "print", "2629": "insight", "2630": "elizabeth", "2631": "colors", "2632": "frightening", "2633": "account", "2634": "-ups", "2635": "wear", "2636": "spoof", "2637": "remotely", "2638": "paced", "2639": "multiple", "2640": "fare", "2641": "brooks", "2642": "status", "2643": "pile", "2644": "lights", "2645": "legendary", "2646": "interview", "2647": "highlight", "2648": "execution", "2649": "donald", "2650": "breaking", "2651": "ain", "2652": "$", "2653": "weekend", "2654": "stolen", "2655": "reputation", "2656": "productions", "2657": "prefer", "2658": "narration", "2659": "jail", "2660": "greater", "2661": "weapons", "2662": "position", "2663": "interviews", "2664": "forest", "2665": "bus", "2666": "whoever", "2667": "repeated", "2668": "path", "2669": "mistakes", "2670": "mexican", "2671": "imagery", "2672": "focused", "2673": "arms", "2674": ".com", "2675": "hired", "2676": "false", "2677": "dude", "2678": "demons", "2679": "sir", "2680": "occasional", "2681": "flashback", "2682": "india", "2683": "fulci", "2684": "critical", "2685": "convinced", "2686": "alright", "2687": "13", "2688": "mainstream", "2689": "betty", "2690": "wolf", "2691": "environment", "2692": "arrives", "2693": "task", "2694": "sounded", "2695": "rights", "2696": "nurse", "2697": "mildly", "2698": "funnier", "2699": "device", "2700": "deeper", "2701": "closing", "2702": "carpenter", "2703": "atrocious", "2704": "-but", "2705": "theory", "2706": "scenario", "2707": "raised", "2708": "massacre", "2709": "lifetime", "2710": "helen", "2711": "heavily", "2712": "gritty", "2713": "expression", "2714": "depiction", "2715": "choices", "2716": "-screen", "2717": "thankfully", "2718": "stranger", "2719": "stayed", "2720": "placed", "2721": "listening", "2722": "explains", "2723": "decades", "2724": "combined", "2725": "/director", "2726": "technically", "2727": "suck", "2728": "ruin", "2729": "underground", "2730": "teeth", "2731": "necessarily", "2732": "warned", "2733": "treasure", "2734": "regarding", "2735": "paying", "2736": "lie", "2737": "focuses", "2738": "driven", "2739": "dozen", "2740": "amazed", "2741": "walter", "2742": "serve", "2743": "nonetheless", "2744": "figures", "2745": "buying", "2746": "anger", "2747": "offered", "2748": "murderer", "2749": "kiss", "2750": "examples", "2751": "dress", "2752": "downright", "2753": "changing", "2754": "welcome", "2755": "victor", "2756": "superman", "2757": "nazi", "2758": "magical", "2759": "dracula", "2760": "blown", "2761": "blockbuster", "2762": "`s", "2763": "urban", "2764": "spite", "2765": "reveals", "2766": "mob", "2767": "julia", "2768": "hoffman", "2769": "fu", "2770": "flight", "2771": "east", "2772": "bore", "2773": "understood", "2774": "unconvincing", "2775": "southern", "2776": "sinatra", "2777": "mature", "2778": "friday", "2779": "dinner", "2780": "baseball", "2781": "wins", "2782": "usa", "2783": "uninteresting", "2784": "tree", "2785": "seek", "2786": "screening", "2787": "luke", "2788": "kinds", "2789": "designed", "2790": "charge", "2791": "via", "2792": "throws", "2793": "spy", "2794": "originality", "2795": "lawyer", "2796": "hole", "2797": "halfway", "2798": "skill", "2799": "shorts", "2800": "miller", "2801": "mickey", "2802": "initially", "2803": "goofy", "2804": "criticism", "2805": "angle", "2806": "lonely", "2807": "civil", "2808": "blah", "2809": "timing", "2810": "sunday", "2811": "sensitive", "2812": "pregnant", "2813": "paint", "2814": "kane", "2815": "ignore", "2816": "flow", "2817": "court", "2818": "complicated", "2819": "campy", "2820": "birth", "2821": "25", "2822": "term", "2823": "succeeds", "2824": "significant", "2825": "scares", "2826": "rain", "2827": "throwing", "2828": "passing", "2829": "indie", "2830": "barry", "2831": "adding", "2832": "views", "2833": "rolling", "2834": "racism", "2835": "quirky", "2836": "mere", "2837": "delivery", "2838": "code", "2839": "causes", "2840": "suffer", "2841": "nuclear", "2842": "handle", "2843": "facial", "2844": "entertain", "2845": "base", "2846": ",i", "2847": "served", "2848": "ratings", "2849": "ludicrous", "2850": "inept", "2851": "breath", "2852": "attempting", "2853": "stays", "2854": "shadow", 